reddit-clone/app/views/posts/edit.html.erb

  Associated Subs<br>
  <% Sub.all.each do |sub| %>
    <label><%= sub.title %>
      <input type="checkbox" name="post[sub_ids][]" value="<%= sub.id %>" <%= "checked=\"checked\"" if @post.subs.include?(sub) %>>
---
SELECT "subs".* FROM "subs"
SELECT "subs".* FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1 AND "subs"."id" = $2  [["post_id", 2], ["id", 1]]