reddit-clone/app/controllers/posts_controller.rb

INSERT INTO "post_subs" ("post_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 2], ["sub_id", 1], ["created_at", "2015-03-13 23:26:44.228260"], ["updated_at", "2015-03-13 23:26:44.228260"]]
INSERT INTO "posts" ("title", "content", "url", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "aasdf"], ["content", "asfasdfasdf"], ["url", "asdf.com"], ["author_id", 4], ["created_at", "2015-03-13 23:26:44.185178"], ["updated_at", "2015-03-13 23:26:44.185178"]]
---
  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id

    PostSub.create(post: @post, sub_id: params[:sub_id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "I'm the best"], ["updated_at", "2015-03-13 22:32:45.719253"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)