reddit-clone/app/controllers/users_controller.rb

    def find_or_initialize_user
      @user = params[:id] ? User.find(params[:id]) : User.new
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]